app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "created_at", "updated_at", "password_digest", "activation_digest") VALUES (?, ?, ?, ?, ?, ?)
---
  def create # post
    @user = User.new user_params
    if @user.save

UPDATE "users" SET "name" = ?, "email" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "Foo Bar"], ["email", "foo@bar.com"], ["updated_at", "2017-08-21 11:16:59.999335"], ["id", 762146111]]
---
  def update # patch
    if @user.update_attributes user_params

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1046959424], ["LIMIT", 1]]
---
  def load_user
    @user = User.find_by id: params[:id]